[
    {
        "id": 1,
        "name": "Intro to the Scientific Study of Language",
        "description": "Overview of the scientific study of the structure and function of language. Introduces the main fields of linguistics: phonetics, phonology, morphology, syntax, semantics, discourse, historical linguistics, sociolinguistics, and psycholinguistics. Highlights the interdisciplinary relationship of linguistics with anthropology, sociology, psychology, and cognitive sciences."
    },
    {
        "id": 2,
        "name": "Revolutions and Utopias",
        "description": "In order to gain a more precise grasp of our contemporary political challenges and possibilities, this course in political anthropology investigates a wide range of historical and contemporary cases of rapid political and social transformation and carefully examines the ideas, desires and utopias that inspired them."
    },
    {
        "id": 3,
        "name": "Law and Resistance",
        "description": "This course will explore how people interact with the law in their everyday lives – in the U.S. and elsewhere. Examples will include how individuals experience and respond to policing, examining the effects of immigration and border security policies, and tracing how people and groups mobilize to challenges laws perceived as unjust. "
    },
    {
        "id": 4,
        "name": "People and Animals in the Past",
        "description": "This course asks students to consider the human as a special kind of animal, and the roles of other animals in our human worlds: as companions, spirits, artistic muses, laborers, and as sources of food, clothing, shelter, and tools. We examine how human-animal relationships have changed over time, and consider human impacts upon animals and environments at multiple scales: from continental and island colonizations, to local extirpations and global extinctions. While our scope is both geographically and temporally broad, specific case studies will be highlighted from Africa, Eurasia, North America, and the Pacific islands."
    },
    {
        "id": 5,
        "name": "Neurosciences 1",
        "description": "Understanding the normal functioning of the peripheral and central nervous systems and how they are affected by disease. • Developing skills of analysing normal and abnormal movement allowing students to clinically reason. • The tools needed to assess the patient with a neurological impairment to identify an effective management plan."
    },
    {
        "id": 6,
        "name": "Cardiorespiratory 1",
        "description": "Module\tCredits\tCompulsory/optional Foundations for Physiotherapy Practice\t30 Credits\tCompulsory Cardiorespiratory 1\t15 Credits\tCompulsory The student will learn about the normal f unction of the cardiovascular and respiratory systems and how they are affected by disease. The focus of the module will be developing the following skills for students: • Assessing the patient with cardiorespiratory dysfunction, identifying their problems using clinical reasoning skills."
    },
    {
        "id": 7,
        "name": "Foundations for Physiotherapy Practice",
        "description": "The student will be introduced to the systems of the body, movement analysis, motor learning and therapeutic exercise prescription. The focus of the module will be on developing the following skills: • Movement analysis • The safe and effective application of therapeutic exercise for healthy individuals and across a range of special populations."
    },
    {
        "id": 8,
        "name": "Musculoskeletal 1",
        "description": "During this module students will cover the anatomy, biomechanics and common pathologies affecting patients who have dysfunction in the lower limb and lumbar spine. The focus of the module will be developing the following skills for students: • Clinical reasoning skills to develop safe and effective assessment, treatment and management plans and to evaluate their outcomes."
    },
    {
        "id": 9,
        "name": "Astrophysics",
        "description": "There are eight 24-lecture courses spread over Michaelmas and Lent Terms, which teach the fundamental physics underlying the course and the main areas of contemporary astronomy - viz relativity, quantum mechanics, cosmology, stars, physics of astrophysics, dynamics, fluids and statistical physics."
    },
    {
        "id": 10,
        "name": "Chemistry",
        "description": "The course builds on the ideas which were presented in the first and second year, and offers students the opportunity to both broaden and deepen their knowledge of chemistry. As the year progresses there is the opportunity for students to narrow their focus somewhat, for example towards chemical biology or chemical physics; however, they can equally well choose to pursue a broad range of topics across all areas of chemistry. "
    },
    {
        "id": 11,
        "name": "Pathology",
        "description": "This course offers study in the main constituent disciplines of Pathology. In order to facilitate study in depth each discipline is presented as an optional subject."
    },
    {
        "id": 12,
        "name": "Psychology, Neuroscience and Behaviour",
        "description": "The neurosciences are one of the most exciting and fast moving areas in biology and these features are well represented in this interdepartmental course. Neurosciences are noted for the breadth of their theoretical base in diverse areas of modern biology and in the range of their medical and social applications."
    },
    {
        "id": 13,
        "name": "Programming 1",
        "description": "This module teaches students the fundamentals of programming in Java. Students will learn to develop and debug simple programs using basic programming concepts."
    },
    {
        "id": 14,
        "name": "Concepts of Computer Science",
        "description": "This module along with CS-155 gives an overview of some of the main principles underlying computers and computing from both a theoretical and an applied point of view. Following a brief history of computers and software an introduction to the representation of data and the basic components of a computer will be given."
    },
    {
        "id": 15,
        "name": "Programming 2",
        "description": "This module is a continuation of the module CS-110 Programming 1. In it, students will continue to enhance their skills in programming, as well as gain a basic understanding of algorithms and data structures."
    },
    {
        "id": 16,
        "name": "Modelling Computing Systems",
        "description": "This module will follow on from CS-170 and introduces students to mathematical tools and techniques for modeling computing systems."
    }
]